{
  "backend/main.mo": "Motoko canister implementing user profiles and diary entries with access control, supporting CRUD-like operations including timestamp‑based deletion.",
  "feature_evidence.json": "Feature evidence report listing requirements, affected files, and components for delete-behavior fixes and backend delete API integration.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of all frontend diary, UI, and utility components.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme variables for light/dark modes and global background/foreground tokens.",
  "frontend/index.html": "Root HTML document loading the React app and setting the title to Unsaid Echoe.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, loading states, and rendering the diary screen within a theme provider.",
  "frontend/src/components/AuthButton.tsx": "Button handling Internet Identity login/logout with loading states and query-cache clearing.",
  "frontend/src/components/InlineStatus.tsx": "Inline loading, error, and empty UI component with skeleton variant for diary entry placeholders.",
  "frontend/src/components/LockedScreen.tsx": "Unauthenticated landing screen showing app branding and sign‑in prompt.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form allowing new users to submit a name and save their profile.",
  "frontend/src/components/ThemeSwitcher.tsx": "Dropdown for selecting between six visual themes using next‑themes.",
  "frontend/src/features/diary/DiaryEditor.tsx": "Editor component for creating or modifying diary entries, handling text, photo uploads, color tags, and save/delete actions.",
  "frontend/src/features/diary/DiaryList.tsx": "Displays a scrollable list of diary entries with previews, timestamps, and color tags, allowing selection by timestamp.",
  "frontend/src/features/diary/DiaryScreen.tsx": "Main diary UI combining entry list, editor, and header, managing entry selection and creation state.",
  "frontend/src/features/diary/EntryColorPicker.tsx": "Color selection UI offering preset color options for diary entries.",
  "frontend/src/features/diary/EntryColorTag.tsx": "Renders a small colored circle indicating an entry's color tag.",
  "frontend/src/features/diary/hooks/useDiaryEntries.ts": "React Query hook to fetch all diary entries using the backend actor.",
  "frontend/src/features/diary/hooks/useDiaryMutations.ts": "Mutation hooks for adding and deleting diary entries, invalidating cached queries on success.",
  "frontend/src/features/diary/PhotoAttachmentPicker.tsx": "Handles image file selection, validation, previewing, and removal for diary photo attachments.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity state, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence via a React context.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch and update the current user's profile via an actor, with cache invalidation on save.",
  "frontend/src/index.css": "Defines Tailwind base layers and multiple theme color variables for light, dark, ocean, and sunset modes.",
  "frontend/src/lib/utils.ts": "Exports a cn utility that merges Tailwind and conditional class names using clsx and twMerge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, supporting both query and hash routing with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing diary app features, issues, and requirements tracking."
}